Repository: A6GibKm/Curtail
Catalog: po/*.po
Languages: cs, es_es

source: Compress your images
cs: Komprimujte vaše obrázky

source: Curtail is an useful image compressor, supporting PNG, JPEG and WEBP file types.
cs: Curtail je použitelný kompresor obrázků, popdporující PNG, JPEG a WEBP soubory.

source: It support both lossless and lossy compression modes with an option to whether keep or not metadata of images.
cs: Podporuje režimy bezeztrátové i ztrátové komprese s možností zachovat nebo nezachovat metadata obrázků.
es_es: Tiene soporte para compresión con y sin pérdida, y con opción para guardar metadatos de imágenes.

source: Here's the changelog of this version:
cs: Zde je seznam změn této verze:

source: Add WEBP support. Thank's to @olokelo.
cs: Přidána podpora WEBP. Díky patří @olokelo.

source: Add Croatian translation. Thank's to @milotype.
cs: Přidány chorvatské překlady. Díky patří @milotype.

source: Update Spanish translation. Thank's to @oscfdezdz.
cs: Aktualizovány španělské překlady. Díky patří @oscofdezdz.

source: Update Portuguese (Brazil) translation. Thank's to @fulvio-alves.
cs: Aktualizovány portugalské (Brazílie) překlady. Díky patří @fulvio-alves.

source: Better guess of extensions. Thank's to @akozlovskiy119.
cs: Lepší rozšíření (guess). Díky patří @akozlovskiy119

source: Fix directory handling. Thank's to @akozlovskiy119.
cs: Opraveno předávání adresáře. Díky patří @akozlovskiy119.

source: Fix missing icon in LXQt, MATE, XFCE (#76). Thank's to @apandada1.
cs: Opraveny chybějící ikony v LXQt, MATE, XFCE (#76). Díky patří @apandada1.

source: An option to progressive encode jpegs. Thank's to @trst.
cs: An option to progressive encode jpegs. Díky patří @trst.

source: Add Russian translation.
cs: Přidány ruské překlady.

source: Add Slovak translation.
cs: Přidány slovenské překlady.

source: Add Swedish translation.
cs: Přidány švedské překlady.

source: Update Spanish translation.
cs: Aktualizovány španělské překlady.

source: Center preferences window header switcher. Thank's to @andrenete.
cs: Center preferences window header switcher. Díky patří @andrenete.

source: Fix columns sorting. Thank's to @andrenete.
cs: Fix columns sorting. Díky patří @andrenete.

source: Don't allow empty suffix (incorrect compression for JPEG). Thank's to @andrenete.
cs: Don't allow empty suffix (incorrect compression for JPEG). Díky patří @andrenete.

source: A new name. Thank's to @bertob, @jannuary and @jimmac.
cs: Nové jméno. Díky patří @bertob, @jannuary und @jimmac.

source: A new icon designed by @jimmac.
cs: Nová ikona navržená od @jimmac.

source: Support for dragging folders.
cs: Podpora pro přenášení složek.

source: Add Portuguese (Brazil) translation
cs: Přidány portugalské (Brazílie) překladů.

source: Update translations
cs: Aktualizovány překlady.

source: Change description
cs: Změněn popisek

source: Initial version
cs: První verze

source: Save into a new file
cs: Uložit do nového souboru
es_es: Guardar en un nuevo archivo

source: Save the compressed image into a new file.
cs: Uložit komprimovaný obrázek do nového souboru.
es_es: Guardar imagen comprimida en un nuevo archivo.

source: Keep metadata
cs: Zachovat metadata
es_es: Mantener metadatos

source: This setting preserves metadata of images.
cs: Toto nastavení zachovává metadata obrázků.
es_es: Esta opción mantiene metadatos de imágenes.

source: Enable lossy mode
cs: Povolit ztrátový režim.
es_es: Habilitar compresión con pérdida

source: Use lossy mode to compress images.
cs: Povolit ztrátový režim pro komprimované obrázky.
es_es: Usar compresión con pérdida al comprimir imágenes.

source: Suffix to append at end of new file
cs: Přípona, která se připojí na konec nového souboru
es_es: Sufijo para agregar al final del nuevo archivo

source: Suffix to append at end of new file.
cs: Přípona, která se připojí na konec nového souboru.
es_es: Sufijo para agregar al final del nuevo archivo.

source: PNG Lossy Compression Level
cs: Úroveň ztrátové komprese PNG
es_es: Nivel de compresión PNG con pérdida

source: Lossy compression level to use for PNG images.
cs: Úroveň ztrátové komprese, která se použije pro obrázky PNG.
es_es: Nivel de compresión con pérdida para usar con imágenes PNG.

source: PNG Lossless Compression Level
cs: Úroveň bezztrátové komprese PNG
es_es: Nivel de compresión PNG sin pérdida

source: Lossless compression level to use for PNG images.
cs: Úroveň bezeztrátové komprese, která se použije pro obrázky PNG..
es_es: Nivel de compresión sin pérdida para usar con imágenes PNG.

source: WEBP Lossless Compression Level
cs: Úroveň bezeztrátové komprese WEBP

source: Lossless compression level to use for WEBP images.
cs: Úroveň bezeztrátové komprese, která se použije pro obrázky WEBP.

source: JPG Lossy Compression Level
cs: Úroveň ztrátové komprese JPG
es_es: Nivel de compresión JPG con pérdida

source: Lossy compression level to use for JPG images.
cs: Úroveň ztrátové komprese, která se použije pro obrázky JPG.
es_es: Nivel de compresión con pérdida para usar con imágenes JPG.

source: WEBP Lossy Compression Level
cs: Úroveň ztrátové komprese WEBP

source: Lossy compression level to use for WEBP images.
cs: Úroveň ztrátové komprese, která se použije pro obrázky WEBP.

source: Enable progressive encoding for jpegs
cs: Progressives Encodieren für jpegs aktivieren

source: Optionally encode jpeg images progressively.
cs: Optionales progressives Encodieren von jpeg-Bildern.

source: Enable dark theme
cs: Dunkles Thema verwenden
es_es: Habilitar tema oscuro

source: Use dark theme for the windows.
cs: Dunkles Thema für Fenster verwenden.
es_es: Usar tema oscuro para las ventanas.

source: Drag and drop your images here...
cs: Bilder hierher ziehen…
es_es: Arrastra y suelta las imágenes aquí...

source: or
cs: oder
es_es: o

source: Browse your files
cs: Dateien durchsuchen
es_es: Navega por los archivos

source: Lossless
cs: Verlustfrei
es_es: Sin pérdida

source: Lossy
cs: Verlustbehaftet
es_es: Con pérdida

source: Preferences
cs: Předvolby
es_es: Preferencias

source: Save the compressed image into a new file
cs: Uložit kompresovaný obrázek do nového souboru
es_es: Guardar imagen comprimida en un nuevo archivo

source: General
cs: Obecné

source: Compression
cs: Komprese
es_es: Compresión

source: PNG Lossless Compression Level (the higher it is, the slower it is)
cs: PNG Verlustfreier Komprimierungsgrad (umso höher, desto langsamer)
es_es: Nivel de compresión PNG sin pérdida (cuanto más alto, más lento)

source: WEBP Lossless Compression Level (the higher it is, the slower it is)
cs: WEBP Verlustfreier Komprimierungsgrad (umso höher, desto langsamer)

source: Progressive Encode JPG
cs: Progressive Encodierung JPG

source: Advanced
cs: Erweitert
es_es: Avanzado

source: File already exists
cs: Datei existiert bereits

source: Compress
cs: Komprimiere

source: Skip
cs: Überspringen

source: Apply to all queue
cs: Auf ganze Warteschlange anwenden

source: About Curtail
cs: Info zu Curtail

source: Filename
cs: Dateiname
es_es: Nombre del Archivo

source: Old Size
cs: Alte Größe
es_es: Viejo Tamaño

source: New Size
cs: Neue Größe
es_es: Nuevo Tamaño

source: Savings
cs: Einsparung
es_es: Guardados

source: Images are saved with <b>'{}' suffix</b>.
cs: Bilder werden mit dem <b>Zusatz '{}'</b> gespeichert.
es_es: Las imágenes se guardan con <b> el sufijo '{}'</b>.

source: Images are <b>overwritten</b>.
cs: Bilder werden <b>überschrieben</b>.
es_es: Las imágenes <b>se sobreescriben</b>.

source: Format not supported
cs: Nicht unterstütztes Format
es_es: No hay soporte para el formato

source: The format of {} is not supported.
cs: Das Format von {} wird nicht unterstützt.
es_es: No hay soporte para el formato de {}

source: Path not valid
cs: Ungültiger Pfad
es_es: Ruta de archivo incorrecta

source: {} doesn't exist.
cs: {} existiert nicht.
es_es: {} no existe.

source: translator-credits
cs: Onno Giesmann
es_es: Josué Quilón Barrios

source: Distributed under the GNU GPL(v3) license.
cs: Veröffentlicht unter der Lizenz GNU GPL(v3).
es_es: Distribuido bajo licencia GNU GPL(v3)

source: An error has occured
cs: Es ist ein Fehler aufgetreten
es_es: Se ha producido un error

source: The file <b>{}</b> already exists. Do you want to compress the image anyway?
cs: Die Datei <b>{}</b> existiert bereits. Möchten Sie das Bild trotzdem komprimieren?

source: All images
cs: Alle Bilder
es_es: Todas las imágenes

source: PNG images
cs: PNG-Bilder
es_es: Imágenes PNG

source: JPEG images
cs: JPEG-Bilder
es_es: Imágenes JPEG

source: WEBP images
cs: WEBP-Bilder

source: Simple & useful image compressor.
es_es: Sencillo y útil compresor de imágenes.

source: Simple &amp; useful image compressor
es_es: Sencillo & útil compresor de imágenes

source: ImCompressor is an useful image compressor, supporting PNG and JPEG file types.
es_es: ImCompressor es un compresor de imágenes con soporte para los formatos PNG y JPEG.

source: Simple & useful image compressor
es_es: Sencillo y útil compresor de imágenes

source: About ImCompressor
es_es: Sobre ImCompressor

source: Operation not supported
es_es: No hay soporte para la operación

source: Discovery of images in folders is not yet supported.
es_es: No hay soporte para descubrimiento de imágenes en carpetas.

source: Nothing
es_es: Nada

source: Compression not useful
es_es: Compresión no útil

source: {} is already compressed at max with current options.
es_es: {} ya está comprimida al máximo con las opciones actuales.
